app/Controllers/AuthController.php

    public function loginPost()
    {
        $session = session();
        $email   = $this->request->getPost('email');
        $mdp     = $this->request->getPost('mot_de_passe');
        $errors  = [];

        if (empty($email) || empty($mdp)) {
            $errors[] = "Email et mot de passe obligatoires.";
            return view('auth/login', ['errors' => $errors]);
        }

        // Vérifier si c'est un admin
        $adminModel = new \App\Models\AdminModel();
        $admin      = $adminModel->where('email', $email)->first();

        if ($admin && password_verify($mdp, $admin['mot_de_passe'])) {
            $session->set([
                'admin_id'    => $admin['id'],
                'admin_email' => $admin['email'],
                'is_admin'    => true,
            ]);
            return redirect()->to(base_url('admin/dashboard'));
        }

        // Vérifier si c'est un utilisateur
        $userModel = new \App\Models\UserModel();
        $user      = $userModel->where('email', $email)->first();
---
SELECT *
FROM `admins`
WHERE `email` = 'alice@gmail.com'
 LIMIT 1
SELECT *
FROM `users`
WHERE `email` = 'alice@gmail.com'
 LIMIT 1