app/Controllers/WalletController.php

        $userModel = new UserModel();
        $user = $userModel->find($session->get('user_id'));
        $nouveauSolde = ($user['wallet'] ?? 0) + $codeRow['montant'];
        $userModel->update($session->get('user_id'), ['wallet' => $nouveauSolde]);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function index()
    {
        $session = session();
        if (!$session->get('user_id')) {
            return redirect()->to('/login');
        }

        $userModel = new UserModel();
        $user = $userModel->find($session->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'